Revit 2027 API
BuiltInFailures.SketchFailures.StairTooManyConnectedBoundaries Property
 Stairs require no more than two boundaries (chains of one or more Boundary Lines).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairTooManyConnectedBoundaries { get; }
Public Shared ReadOnly Property StairTooManyConnectedBoundaries As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairTooManyConnectedBoundaries {
	FailureDefinitionId^ get ();
}
static member StairTooManyConnectedBoundaries : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace